app/Controllers/Sekolah.php

    public function saveSiswa()
    {
        // debug dump data
        // dd($this->request->getVar());
        $nama = $this->request->getVar('nama');
        if (isset($nama)) {
            $param = $nama;
            $slug = md5($param);
            $date = date('d-m-y');
            $slug = md5($param.$date);
            // Format UUID (8-4-4-4-12)
            $formatted = substr($slug, 0, 8) . '-' .
                 substr($slug, 8, 4) . '-' .
                 substr($slug, 12, 4) . '-' .
                 substr($slug, 16, 4) . '-' .
                 substr($slug, 20, 12);
            // echo '<br>';
            // echo $formatted;
         }
        $this->siswaModel->save([
            'nama'=>$this->request->getVar('nama'),
            'nis'=>$this->request->getVar('nis'),
            'kelas'=>$this->request->getVar('kelas'),
            'alamat'=>$this->request->getVar('alamat'),
            'id_guru_wali'=>$this->request->getVar('walikelas'),
            'slug'=>$formatted,
            'created_at'=>$date,
            'updated_at'=>$date,
        ]);
---
INSERT INTO `siswa` (`nama`, `nis`, `kelas`, `alamat`, `id_guru_wali`, `slug`, `created_at`, `updated_at`) VALUES ('nuryani', '2205567894', '12A', 'Jl. Kenanga No. 12, Surabaya ', '1', 'f873f017-2d7f-e350-65fc-f8fa080395cd', '2025-04-05 12:27:47', '2025-04-05 12:27:47')