app/Models/Guru.php

SELECT *
FROM `guru`
SELECT *
FROM `guru`
WHERE `slug` = '3c3d34f4-339c-ea3b-afda-b01eacf6fe7b'
 LIMIT 1
---
    public function getGuru($slug = false)
    {
        if ($slug == false) {
            // sama seperti select * from guru;
            return $this->findAll();
        }
        return $this->where(['slug' => $slug])->first();