app/Models/Siswa.php

    public function getSiswa($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
        }
        return $this->where(['slug' => $slug])->first();
---
SELECT *
FROM `siswa`
SELECT *
FROM `siswa`
WHERE `slug` = '51f76f27-4a9e-22a6-eead-9b2d3c6ac469'
 LIMIT 1